In [1]:
people = {"First_name" : ["Haripriya","Sathish","xyz"],
          "Last_name" : ["karuna","karuna","abc"],
          "email" : ["haripriya@gmail.com","sathish@gmail.com","xyzabc@gmail.com"]}

In [2]:
import pandas as pd
df = pd.DataFrame(people)
df

  First_name Last_name                email
0  Haripriya    karuna  haripriya@gmail.com
1    Sathish    karuna    sathish@gmail.com
2        xyz       abc     xyzabc@gmail.com

In [3]:
# to combine two columns and create it as new column

df["First_name"] + " " + df["Last_name"]

0    Haripriya karuna
1      Sathish karuna
2             xyz abc
dtype: object

In [4]:
# to make it as new column

df["full_name"] = df["First_name"] + " " + df["Last_name"]
df

  First_name Last_name                email         full_name
0  Haripriya    karuna  haripriya@gmail.com  Haripriya karuna
1    Sathish    karuna    sathish@gmail.com    Sathish karuna
2        xyz       abc     xyzabc@gmail.com           xyz abc

In [5]:
# to delete a columns

df.drop(columns = ["First_name","Last_name"])

                 email         full_name
0  haripriya@gmail.com  Haripriya karuna
1    sathish@gmail.com    Sathish karuna
2     xyzabc@gmail.com           xyz abc

In [6]:
df  # to make that change permanently

  First_name Last_name                email         full_name
0  Haripriya    karuna  haripriya@gmail.com  Haripriya karuna
1    Sathish    karuna    sathish@gmail.com    Sathish karuna
2        xyz       abc     xyzabc@gmail.com           xyz abc

In [7]:
df.drop(columns = ["First_name","Last_name"],inplace = True)

In [8]:
df

                 email         full_name
0  haripriya@gmail.com  Haripriya karuna
1    sathish@gmail.com    Sathish karuna
2     xyzabc@gmail.com           xyz abc

In [9]:
# Again if you want to split the full name into first and last

df["full_name"].str.split(" ")

0    [Haripriya, karuna]
1      [Sathish, karuna]
2             [xyz, abc]
Name: full_name, dtype: object

In [10]:
df["full_name"].str.split(" ",expand = True)

           0       1
0  Haripriya  karuna
1    Sathish  karuna
2        xyz     abc

In [11]:
df[["First_name","last_name"]] = df["full_name"].str.split(" ",expand = True)

In [12]:
df

                 email         full_name First_name last_name
0  haripriya@gmail.com  Haripriya karuna  Haripriya    karuna
1    sathish@gmail.com    Sathish karuna    Sathish    karuna
2     xyzabc@gmail.com           xyz abc        xyz       abc

In [13]:
# to add a new row with single data

df.append({"First_name" : "Krishnaveni"}) # Can only append a dict if ignore_index=True

TypeError: Can only append a dict if ignore_index=True

In [14]:
df.append({"First_name" : "Krishnaveni"},ignore_index = True)

                 email         full_name   First_name last_name
0  haripriya@gmail.com  Haripriya karuna    Haripriya    karuna
1    sathish@gmail.com    Sathish karuna      Sathish    karuna
2     xyzabc@gmail.com           xyz abc          xyz       abc
3                  NaN               NaN  Krishnaveni       NaN

In [15]:
# by the approach , we can add multiple data in a new row

df.append({"First_name" : "Krishnaveni","email" : "krish@gmail.com",
           "full_name" : "krishnaveni k","last_name" : "K"},ignore_index = True)

                 email         full_name   First_name last_name
0  haripriya@gmail.com  Haripriya karuna    Haripriya    karuna
1    sathish@gmail.com    Sathish karuna      Sathish    karuna
2     xyzabc@gmail.com           xyz abc          xyz       abc
3      krish@gmail.com     krishnaveni k  Krishnaveni         K

In [16]:
df = df.append({"First_name" : "Krishnaveni","email" : "krish@gmail.com",
           "full_name" : "krishnaveni k","last_name" : "K"},ignore_index = True)

In [17]:
df

                 email         full_name   First_name last_name
0  haripriya@gmail.com  Haripriya karuna    Haripriya    karuna
1    sathish@gmail.com    Sathish karuna      Sathish    karuna
2     xyzabc@gmail.com           xyz abc          xyz       abc
3      krish@gmail.com     krishnaveni k  Krishnaveni         K

In [18]:
# to combine a dataframe into another dataframe

people1 = {"full_name" : ["Kumari K","puppy cute"],"First_name" : ["Kumari","puppy"],
         "last_name" : ["K","cute"],"email" : ["kumari@gmail.com","puppy@gmail.com"]}

In [19]:
df1 = pd.DataFrame(people1)

In [20]:
df1

    full_name First_name last_name             email
0    Kumari K     Kumari         K  kumari@gmail.com
1  puppy cute      puppy      cute   puppy@gmail.com

In [21]:
df.append(df1,ignore_index = True)  # got appended

                 email         full_name   First_name last_name
0  haripriya@gmail.com  Haripriya karuna    Haripriya    karuna
1    sathish@gmail.com    Sathish karuna      Sathish    karuna
2     xyzabc@gmail.com           xyz abc          xyz       abc
3      krish@gmail.com     krishnaveni k  Krishnaveni         K
4     kumari@gmail.com          Kumari K       Kumari         K
5      puppy@gmail.com        puppy cute        puppy      cute

In [22]:
df = df.append(df1,ignore_index = True)
df

                 email         full_name   First_name last_name
0  haripriya@gmail.com  Haripriya karuna    Haripriya    karuna
1    sathish@gmail.com    Sathish karuna      Sathish    karuna
2     xyzabc@gmail.com           xyz abc          xyz       abc
3      krish@gmail.com     krishnaveni k  Krishnaveni         K
4     kumari@gmail.com          Kumari K       Kumari         K
5      puppy@gmail.com        puppy cute        puppy      cute

In [23]:
# when we create a dataframe to combine with other dataframe, if any columns are not present as per the other column it will give NaN when we add data
# it will give some warning but anyway it is going to give output but if we dont want to get warning we use sort

# eg.
# df.append(df1,ignore_index = True,sort = False)

In [24]:
# when we want to remove a row, we can do that using drop with index

df = df.drop(index = 5) # 5th index which is puppy has been removed

In [25]:
df

                 email         full_name   First_name last_name
0  haripriya@gmail.com  Haripriya karuna    Haripriya    karuna
1    sathish@gmail.com    Sathish karuna      Sathish    karuna
2     xyzabc@gmail.com           xyz abc          xyz       abc
3      krish@gmail.com     krishnaveni k  Krishnaveni         K
4     kumari@gmail.com          Kumari K       Kumari         K

In [28]:
# to remove a data in a column with an condition like last_name of "karuna" remove

filt = df["last_name"] == "karuna"
df.drop(index = df[filt].index)      # now the row that contained last name of karuna is removed

              email      full_name   First_name last_name
2  xyzabc@gmail.com        xyz abc          xyz       abc
3   krish@gmail.com  krishnaveni k  Krishnaveni         K
4  kumari@gmail.com       Kumari K       Kumari         K